## Midterm Project
Sarrah Abdulali (ssa4ec)

I used sakila data from MySQL to create a new sakila_dw data warehouse and show the business transaction of film rentals by customers. I used the customer, staff, rental, payment, inventory, and film tables in this project. The customer and staff tables were imported via SQL, rental was imported via a CSV file, payment was imported into MongoDB then SQL via a JSON file, and the inventory and film tables were imported via SQL and transformed near the end to aid in creating the "df_fact_rentals" fact table. I then created a date dimension for three date typed columns, and then finally authored a SQL query using SUM() to prove it all worked.

### Prerequisites:
#### Import the Necessary Libraries

In [1]:
import os
import json
import pprint
import datetime
import pymongo
import requests
import requests.exceptions
import numpy
from sqlalchemy import create_engine
import pandas as pd

# import os
# import numpy
# import pandas as pd
# from sqlalchemy import create_engine
# import pprint
# import json
# import datetime


# import pymongo
# from sqlalchemy import create_engine

#### Declare & assign connection variables for MySQL server & name the source + destination databases

In [2]:
host_name = "ssa4ec-mysql.mysql.database.azure.com"
port = "3306"
user_id = "sabdulali"
pwd = "Passw0rd123"

src_dbname = "sakila"
dst_dbname = "sakila_dw"

#### Define functions for getting data from and setting data into databases

In [3]:
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### If sakila_dw exists then drop it and create sakila_dw in MySQL

In [4]:
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

### Create & Populate the Dimension Tables
At this point, I executed the script for **Lab 2c** which creates and populates a **Date Dimension** table.  I targeted this script to the new data warehouse database we just created, sakila_dw!

Later in this notebook we will integrate the **dim_date** table with the fact table by performing **lookup operations** to retreive the surrogate primary keys from the date dimension table that correspond with each **date** typed column in the fact table (rental_date, return_date, payment_date).

### Pull data directly from MySQL for the customer and staff tables
Steps taken:
-	1) First, use a select statement to read in the customer table
-	2) Use a select statement to read in the staff table
-	3) Make necessary changes to the customer table
-	4) Make necessary changes to the staff table
-	5) Insert this data into the newly created dim_customer and dim_staff tables in MySQL sakila_dw warehouse

In [5]:
#1) First, use a select statement to read in the customer table

sql_customer = "SELECT * FROM sakila.customer;"
df_customer = get_dataframe(user_id, pwd, host_name, src_dbname, sql_customer)
df_customer.head(2)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [6]:
#2) Use a select statement to read in the staff table

sql_staff = "SELECT * FROM sakila.staff;"
df_staff = get_dataframe(user_id, pwd, host_name, src_dbname, sql_staff)
df_staff.head(2)

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,4,None,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16

In [7]:
#3) Make necessary changes to the customer table

drop_cols = ['store_id','address_id','active','create_date','last_update']
df_customer.drop(drop_cols, axis=1, inplace=True)
df_customer.rename(columns={"customer_id":"customer_key"}, inplace=True)

df_customer.head(2)

   customer_key first_name last_name                                email
0             1       MARY     SMITH        MARY.SMITH@sakilacustomer.org
1             2   PATRICIA   JOHNSON  PATRICIA.JOHNSON@sakilacustomer.org

In [8]:
#4) Make necessary changes to the staff table

drop_cols = ['address_id','picture','store_id','active','username','password','last_update']
df_staff.drop(drop_cols, axis=1, inplace=True)
df_staff.rename(columns={"staff_id":"staff_key"}, inplace=True)

df_staff.head(2)

   staff_key first_name last_name                         email
0          1       Mike   Hillyer  Mike.Hillyer@sakilastaff.com
1          2        Jon  Stephens  Jon.Stephens@sakilastaff.com

In [9]:
#5) Insert this data into the newly created dim_customer and dim_staff tables in MySQL sakila_dw warehouse

db_operation = "insert"

tables = [('dim_customer', df_customer, 'customer_key'),
         ('dim_staff', df_staff, 'staff_key')]

for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

### Read in rental CSV file (extracted from the sakila data warehouse in MySQL)
Steps taken:
-	1) First, specify the path and read in the CSV file
-	2) Perform necessary transformations of dropping and renaming columns
-	3) Load/insert newly created dim_rental table into MySQL

In [10]:
#1) First, specify the path and read in the CSV file

data_dir = os.path.join(os.getcwd(), 'data')
data_file = os.path.join(data_dir, 'sakila.rental.csv')

df_rental = pd.read_csv(data_file, header=0)
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [11]:
#2) Perform necessary transformations of dropping and renaming columns

drop_cols = ['last_update']
df_rental.drop(drop_cols, axis=1, inplace=True)
df_rental.rename(columns={"rental_id":"rental_key","inventory_id":"inventory_key","customer_id":"customer_key","staff_id":"staff_key"}, inplace=True)

df_rental.head(2)

,rental_key,rental_date,inventory_key,customer_key,return_date,staff_key
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1

In [12]:
#3) Load/insert newly created dim_rental table into MySQL

db_operation = "insert"

tables = [('dim_rental', df_rental, 'rental_key')]

for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

### Data extraction from MongoDB into "payment" table from sakila database 
Creating dimension table for payment using JSON file from MySQL that was uploaded to MongoDB, steps taken:
-	1) First, connect to MongoDB locally
-	2) Get data into databases via MongoDB 
-	3) Uploading the JSON file to MongoDB, aka populating MongoDB with the source data
-	4) Extract data from MongoDB and into the inventory dataframe
-	5) Edit payment table/make needed transformations
-	6) Create the dim_payment table for MySQL "sakila_dw" data warehouse + insert data into it
-	7) Validate that the payment table exists in SQL

In [13]:
#1) First, connect to MongoDB

mysql_uid = "sabdulali"
mysql_pwd = "Passw0rd123"

atlas_cluster_name = "cluster0.lsmgeeb"
atlas_database_name = "sakila_dw"
atlas_user_name = "ssa4ec"
atlas_password = "Passw0rd123"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net/{atlas_database_name}"
}

# {"atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net/{atlas_database_name}"
#     "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"}

src_dbname = "sakila"
dst_dbname = "sakila_dw"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://ssa4ec:Passw0rd123@cluster0.lsmgeeb.mongodb.net/sakila_dw

In [14]:
#2) Get data into databases via MongoDB

def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    #f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
    #f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
        #f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
        #f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [15]:
#3) Uploading the JSON file to MongoDB, aka populating MongoDB with the source data

client = pymongo.MongoClient(conn_str["atlas"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"payment" : 'sakila.payment.json',
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

In [16]:
#4) Extract data from MongoDB and into the inventory dataframe

query = {}
collection = "payment"

df_payment = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_payment.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

In [17]:
#5) Edit payment table/make needed transformations

drop_cols = ['last_update']
df_payment.drop(drop_cols, axis=1, inplace=True)
df_payment.rename(columns={"payment_id":"payment_key","customer_id":"customer_key","staff_id":"staff_key","rental_id":"rental_key"}, inplace=True)
df_payment.head(2)

,payment_key,customer_key,staff_key,rental_key,amount,payment_date
0,1,1,1,76,2.99,2005-05-25 11:30:37
1,2,1,1,573,0.99,2005-05-28 10:35:23

In [18]:
#6) Create the dim_payment table for MySQL "sakila_dw" data warehouse + insert data into it

dataframe = df_payment
table_name = 'dim_payment'
primary_key = 'payment_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [19]:
#7) Validate that the payment table exists in SQL

sql_payment = "SELECT * FROM sakila_dw.dim_payment;"
df_dim_payment = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_payment)
df_dim_payment.head(2)

,payment_key,customer_key,staff_key,rental_key,amount,payment_date
0,1,1,1,76,2.99,2005-05-25 11:30:37
1,2,1,1,573,0.99,2005-05-28 10:35:23

### Creating & Populating the Fact Table for Rental Transactions
-	1) Read in the customer (1a), staff (1b), payment (1c), and rental (1d) imported and transformed from earlier
-	2) Read in and transform/make changes to two new tables to use for the rentals fact table: inventory (2a) and film (2b)
Merges:
-	3) Merge the inventory and film tables on "film_key"
-	4) Merge the payment and staff tables on "staff_key"
-	5) Merge the rental and payment tables on "rental_key" and make the necessary changes to get rid of repeating columns and rename some columns to their original name. Name this dataframe "df_fact_rentals" and continue to use this for merges moving forward
-	6) Merge "df_fact_rentals" with the inventory table on "inventory_key"
-	7) Finally, merge "df_fact_rentals" with the customer table on "customer_key". Make the change of dropping both the customer and staff emails and specifying with first and last names are for customers and which are for staff

-	8) Drop unnecessary columns (such as length of film, replacement_cost, etc.), rename "amount" to "payment" for specificity that it is what customers paid, and reorder columns to fit a logical order (keys, dates, payment information, customer information, staff information, film details)

In [20]:
#1a: Read in df_customer from earlier

df_customer.head(2)

   customer_key first_name last_name                                email
0             1       MARY     SMITH        MARY.SMITH@sakilacustomer.org
1             2   PATRICIA   JOHNSON  PATRICIA.JOHNSON@sakilacustomer.org

In [21]:
#1b: Read in df_staff from earlier

df_staff.head(2)

   staff_key first_name last_name                         email
0          1       Mike   Hillyer  Mike.Hillyer@sakilastaff.com
1          2        Jon  Stephens  Jon.Stephens@sakilastaff.com

In [22]:
#1c: Read in df_payment from earlier

df_payment.head(2)

,payment_key,customer_key,staff_key,rental_key,amount,payment_date
0,1,1,1,76,2.99,2005-05-25 11:30:37
1,2,1,1,573,0.99,2005-05-28 10:35:23

In [23]:
#1d: Read in df_rental from earlier

df_rental.head(2)

,rental_key,rental_date,inventory_key,customer_key,return_date,staff_key
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1

In [24]:
#2a: Read in the sakila inventory table

sql_inventory = "SELECT * FROM sakila.inventory;"
df_inventory = get_dataframe(user_id, pwd, host_name, src_dbname, sql_inventory)
df_inventory.head(2)

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 05:09:17
1             2        1         1 2006-02-15 05:09:17

In [25]:
#2a: Make changes to sakila inventory table

drop_cols = ['last_update']
df_inventory.drop(drop_cols, axis=1, inplace=True)
df_inventory.rename(columns={"inventory_id":"inventory_key","film_id":"film_key","store_id":"store_key"}, inplace=True)
df_inventory.head(2)

   inventory_key  film_key  store_key
0              1         1          1
1              2         1          1

In [26]:
#2b: Read in the sakila film table

sql_film = "SELECT * FROM sakila.film;"
df_film = get_dataframe(user_id, pwd, host_name, src_dbname, sql_film)
df_film.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [27]:
#2b: Make changes to sakila film table

drop_cols = ['language_id','original_language_id','special_features','last_update']
df_film.drop(drop_cols, axis=1, inplace=True)
df_film.rename(columns={"film_id":"film_key"}, inplace=True)
df_film.head(2)

,film_key,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,rating
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,PG
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,G

##### Start by merging the inventory and film tables on film_key, and name it df_inventory

In [28]:
#3) Merge the inventory and film tables on "film_key"

df_inventory = pd.merge(df_inventory, df_film, on = 'film_key', how = 'inner')
df_inventory.head(2)

,inventory_key,film_key,store_key,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,rating
0,1,1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,PG
1,2,1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,PG

In [29]:
#4) Merge the payment and staff tables on "staff_key"

df_payment = pd.merge(df_payment, df_staff, on = 'staff_key', how = 'inner')
df_payment.head(2)

,payment_key,customer_key,staff_key,rental_key,amount,payment_date,first_name,last_name,email
0,1,1,1,76,2.99,2005-05-25 11:30:37,Mike,Hillyer,Mike.Hillyer@sakilastaff.com
1,2,1,1,573,0.99,2005-05-28 10:35:23,Mike,Hillyer,Mike.Hillyer@sakilastaff.com

In [30]:
#5) Merge the rental and payment tables on "rental_key" and make the necessary changes to get rid of repeating columns and rename some columns to their original name
#5) Name this dataframe "df_fact_rentals" and continue to use this for merges moving forward

df_fact_rentals = pd.merge(df_rental, df_payment, on = 'rental_key', how = 'inner')
df_fact_rentals.drop(['customer_key_y', 'staff_key_y'], axis=1, inplace=True)
df_fact_rentals.rename(columns={"customer_key_x":"customer_key", "staff_key_x":"staff_key"}, inplace=True)

df_fact_rentals.head(2)

,rental_key,rental_date,inventory_key,customer_key,return_date,staff_key,payment_key,amount,payment_date,first_name,last_name,email
0,18,2005-05-25 01:10:47,3376,19,2005-05-31 06:35:47,2,490,0.99,2005-05-25 01:10:47,Jon,Stephens,Jon.Stephens@sakilastaff.com
1,46,2005-05-25 06:04:08,3318,7,2005-06-02 08:18:08,2,174,5.99,2005-05-25 06:04:08,Jon,Stephens,Jon.Stephens@sakilastaff.com

In [31]:
#6) Merge "df_fact_rentals" with the inventory table on "inventory_key"

df_fact_rentals = pd.merge(df_fact_rentals, df_inventory, on = 'inventory_key', how = 'inner')

df_fact_rentals.head(2)

,rental_key,rental_date,inventory_key,customer_key,return_date,staff_key,payment_key,amount,payment_date,first_name,...,film_key,store_key,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,rating
0,18,2005-05-25 01:10:47,3376,19,2005-05-31 06:35:47,2,490,0.99,2005-05-25 01:10:47,Jon,...,741,1,ROMAN PUNK,A Thoughtful Panorama of a Mad Cow And a Stude...,2006,7,0.99,81,28.99,NC-17
1,46,2005-05-25 06:04:08,3318,7,2005-06-02 08:18:08,2,174,5.99,2005-05-25 06:04:08,Jon,...,730,1,RIDGEMONT SUBMARINE,A Unbelieveable Drama of a Waitress And a Comp...,2006,3,0.99,46,28.99,PG-13

In [32]:
#7) Finally, merge "df_fact_rentals" with the customer table on "customer_key"
#7) Make the change of dropping both the customer and staff emails and specifying with first and last names are for customers and which are for staff

df_fact_rentals = pd.merge(df_fact_rentals, df_customer, on = 'customer_key', how = 'inner')
df_fact_rentals.drop(['email_x', 'email_y'], axis=1, inplace=True)
df_fact_rentals.rename(columns={"first_name_x":"staff_first_name", "last_name_x":"staff_last_name","first_name_y":"customer_first_name","last_name_y":"customer_last_name"}, inplace=True)

df_fact_rentals.head(2)

,rental_key,rental_date,inventory_key,customer_key,return_date,staff_key,payment_key,amount,payment_date,staff_first_name,...,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,rating,customer_first_name,customer_last_name
0,18,2005-05-25 01:10:47,3376,19,2005-05-31 06:35:47,2,490,0.99,2005-05-25 01:10:47,Jon,...,ROMAN PUNK,A Thoughtful Panorama of a Mad Cow And a Stude...,2006,7,0.99,81,28.99,NC-17,RUTH,MARTINEZ
1,110,2005-05-25 18:43:49,4108,19,2005-06-03 18:13:49,2,491,9.99,2005-05-25 18:43:49,Jon,...,TITANS JERK,A Unbelieveable Panorama of a Feminist And a S...,2006,4,4.99,91,11.99,PG,RUTH,MARTINEZ

In [33]:
#8) Drop unnecessary columns (such as length of film, replacement_cost, etc.)
#8) Rename "amount" to "payment" for specificity that it is what customers paid
#8) Reorder columns to fit a logical order (keys, dates, payment information, customer information, staff information, film details)

df_fact_rentals.drop(['store_key','description', 'release_year','rental_duration','length','replacement_cost',], axis=1, inplace=True)
df_fact_rentals.rename(columns={"amount":"payment"}, inplace=True)
ordered_columns = ['rental_key','customer_key','staff_key','inventory_key','payment_key','film_key'
                   ,'rental_date','return_date','payment','payment_date','customer_first_name'
                   ,'customer_last_name','staff_first_name','staff_last_name'
                   ,'title','rental_rate','rating']

df_fact_rentals = df_fact_rentals[ordered_columns]

df_fact_rentals.head(2)

,rental_key,customer_key,staff_key,inventory_key,payment_key,film_key,rental_date,return_date,payment,payment_date,customer_first_name,customer_last_name,staff_first_name,staff_last_name,title,rental_rate,rating
0,18,19,2,3376,490,741,2005-05-25 01:10:47,2005-05-31 06:35:47,0.99,2005-05-25 01:10:47,RUTH,MARTINEZ,Jon,Stephens,ROMAN PUNK,0.99,NC-17
1,110,19,2,4108,491,893,2005-05-25 18:43:49,2005-06-03 18:13:49,9.99,2005-05-25 18:43:49,RUTH,MARTINEZ,Jon,Stephens,TITANS JERK,4.99,PG

### Date Dimension Creation & Integration
Steps taken:
-	1) Used pandas' "to_datetime" feature to turn the rental date, return date, and payment date columns into datetime columns suitable for merging
-	2) Date dimension table data obtained
-	3) Looked up the surrogate primary key corresponding to rental date (3a), return date (3b), and payment date (3c) respectively
-	4) Wrote the dataframe back to the SQL "sakila_dw" database

In [34]:
#1) Used pandas' "to_datetime" feature to turn the rental date, return date, and payment date columns into datetime columns suitable for merging

df_fact_rentals['rental_date'] = pd.to_datetime(df_fact_rentals['rental_date']).dt.date
df_fact_rentals['return_date'] = pd.to_datetime(df_fact_rentals['return_date']).dt.date
df_fact_rentals['payment_date'] = pd.to_datetime(df_fact_rentals['payment_date']).dt.date

In [36]:
#2) Date dimension table data obtained

sql_dim_date = "SELECT date_key, full_date FROM sakila_dw.dim_date;"
df_dim_date = get_dataframe(user_id, pwd, host_name, src_dbname, sql_dim_date)
df_dim_date['full_date'] = pd.to_datetime(df_dim_date['full_date']).dt.date
df_dim_date.head(2)

   date_key   full_date
0  20000101  2000-01-01
1  20000102  2000-01-02

In [37]:
#3a) Looked up the surrogate primary key corresponding to rental date

df_dim_rentals_date = df_dim_date.rename(columns={"date_key" : "rental_date_key", "full_date" : "rental_date"})
df_fact_rentals = pd.merge(df_fact_rentals, df_dim_rentals_date, on='rental_date', how='left')
df_fact_rentals.drop(['rental_date'], axis=1, inplace=True)
df_fact_rentals.head(2)

,rental_key,customer_key,staff_key,inventory_key,payment_key,film_key,return_date,payment,payment_date,customer_first_name,customer_last_name,staff_first_name,staff_last_name,title,rental_rate,rating,rental_date_key
0,18,19,2,3376,490,741,2005-05-31,0.99,2005-05-25,RUTH,MARTINEZ,Jon,Stephens,ROMAN PUNK,0.99,NC-17,NaN
1,110,19,2,4108,491,893,2005-06-03,9.99,2005-05-25,RUTH,MARTINEZ,Jon,Stephens,TITANS JERK,4.99,PG,NaN

In [38]:
#3b) Looked up the surrogate primary key corresponding to return date

df_dim_returns_date = df_dim_date.rename(columns={"date_key" : "return_date_key", "full_date" : "return_date"})
df_fact_rentals = pd.merge(df_fact_rentals, df_dim_returns_date, on='return_date', how='left')
df_fact_rentals.drop(['return_date'], axis=1, inplace=True)
df_fact_rentals.head(2)

,rental_key,customer_key,staff_key,inventory_key,payment_key,film_key,payment,payment_date,customer_first_name,customer_last_name,staff_first_name,staff_last_name,title,rental_rate,rating,rental_date_key,return_date_key
0,18,19,2,3376,490,741,0.99,2005-05-25,RUTH,MARTINEZ,Jon,Stephens,ROMAN PUNK,0.99,NC-17,NaN,NaN
1,110,19,2,4108,491,893,9.99,2005-05-25,RUTH,MARTINEZ,Jon,Stephens,TITANS JERK,4.99,PG,NaN,NaN

In [39]:
#3c) Looked up the surrogate primary key corresponding to payment date

df_dim_payments_date = df_dim_date.rename(columns={"date_key" : "payment_date_key", "full_date" : "payment_date"})
df_fact_rentals = pd.merge(df_fact_rentals, df_dim_payments_date, on='payment_date', how='left')
df_fact_rentals.drop(['payment_date'], axis=1, inplace=True)
df_fact_rentals.head(2)

,rental_key,customer_key,staff_key,inventory_key,payment_key,film_key,payment,customer_first_name,customer_last_name,staff_first_name,staff_last_name,title,rental_rate,rating,rental_date_key,return_date_key,payment_date_key
0,18,19,2,3376,490,741,0.99,RUTH,MARTINEZ,Jon,Stephens,ROMAN PUNK,0.99,NC-17,NaN,NaN,NaN
1,110,19,2,4108,491,893,9.99,RUTH,MARTINEZ,Jon,Stephens,TITANS JERK,4.99,PG,NaN,NaN,NaN

In [40]:
#4) Wrote the dataframe back to the SQL "sakila_dw" database

table_name = "fact_rentals"
primary_key = "rental_key"
db_operation = "insert"

set_dataframe(user_id, pwd, dst_dbname, df_fact_rentals, table_name, primary_key, db_operation)

### Demonstrate that the New Data Warehouse (sakila_dw) Exists and Contains the Correct Data
To demonstrate the viability of my solution, I authored a SQL SELECT statement that returns:
-	Each Customer’s First Name
-	The total amount they paid when staff member Jon helped them rent films

In [41]:
sql_test = """
    SELECT customer.first_name, customer.last_name
        , ROUND(SUM(rental.payment), 3) AS total_spent
    FROM sakila_dw.fact_rentals AS rental
    INNER JOIN sakila_dw.dim_customer AS customer
    ON rental.customer_key = customer.customer_key
    INNER JOIN sakila_dw.dim_staff AS staff
    ON rental.staff_key = staff.staff_key
    WHERE staff.staff_key = '2'
    GROUP BY rental.customer_key
    ORDER BY customer.first_name;
    """.format(dst_dbname)


df_test = get_dataframe(user_id, pwd, host_name, dst_dbname, sql_test)

In [42]:
df_test.head(10)

  first_name  last_name  total_spent
0        AMY      LOPEZ         4.99
1     ANGELA  HERNANDEZ         1.99
2      BETTY      WHITE        12.98
3      CAROL     GARCIA         7.98
4      DONNA   THOMPSON         2.99
5   JENNIFER      DAVIS         7.98
6    JESSICA       HALL         2.99
7   KATHLEEN      ADAMS         1.98
8      LAURA  RODRIGUEZ        18.97
9      LINDA   WILLIAMS         1.99

In [ ]:
#Once I created the rentals fact table in SQL, I exported the table into 3 separate JSON files AND cut out the five columns that corresponded with 
#the staff, customer, and payment tables (payment, customer_first_name, customer_last_name, staff_first_name, staff_last_name). 
#I did this because the bronze table shouldn't contain columns from the dimension tables I read in earlier in the final capstone project (staff, payment, customers)
#I add in these five columns back into the fact rentals table in the final capstone project via a huge sql query to join the tables (via the Silver table)